# Pandas


### 자료구조: Seires와 Dataframe
Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재하는데  /
Series는 시계열과 유사한 데이터로서 index와 value가 존재하고 
Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다.
이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.
시계열: 일정 기간에 대해 시간의 함수로 표현
### Series

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [7]:
fruit = Series([2500,3800,1200,6000],
               index=['apple','banana','pear','cherry'])

In [8]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [9]:
print(fruit.values)

[2500 3800 1200 6000]

In [10]:
print(fruit.index)

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

In [13]:
fruitData = {'apple':2500, 'banana':3800, 'pear':1200, 'cherry':6000}
fruit = Series(fruitData)

In [17]:
print(type(fruitData))
print(type(fruit))

<class 'dict'>
<class 'pandas.core.series.Series'>

In [19]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [20]:
fruit.name = 'fruitPrice'
fruit.index.name = 'fruitName'

In [21]:
fruit

fruitName
apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [22]:
fruitData = {'fruitName':['apple','banana','cherry','pear'],
            'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]
            }

In [31]:
fruitFrame = DataFrame(fruitData, columns = ['fruitPrice','num','fruitName'])

In [32]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      pear

In [33]:
fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [34]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [40]:
fruitFrame['Year'] = 2016

In [41]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      pear  2016

In [43]:
variable = Series([4,2,1],index=[0,2,3])
print(variable)

0    4
2    2
3    1
dtype: int64

In [48]:
fruitFrame['stock']=variable
fruitFrame

   fruitPrice  num fruitName  Year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      pear  2016    1.0

In [46]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','pear','cheey'])
fruit

apple     2500
banana    3800
pear      1200
cheey     6000
dtype: int64

In [51]:
new_fruit = fruit.drop('banana') #drop은 삭제가 아닌 삭제가 된 결과를 보여주는 것
new_fruit

apple    2500
pear     1200
cheey    6000
dtype: int64

In [50]:
fruit #삭제 X

apple     2500
banana    3800
pear      1200
cheey     6000
dtype: int64

In [52]:
fruitName = fruitData['fruitName']
fruitName

['apple', 'banana', 'cherry', 'pear']

In [55]:
fruitFrame = DataFrame(fruitData,
                      index=fruitName,
                      columns=['fruitPrice','num'])
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [56]:
fruitFrame2 = fruitFrame.drop(['apple','cherry'])
fruitFrame2

        fruitPrice  num
banana        3800    5
pear          1200    8

In [58]:
fruitFrame3 = fruitFrame.drop('num',axis=1)
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
pear          1200

In [59]:
fruit

apple     2500
banana    3800
pear      1200
cheey     6000
dtype: int64

In [60]:
fruit['apple':'pear']

apple     2500
banana    3800
pear      1200
dtype: int64

In [62]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

In [63]:
fruit1 = Series([5,9,10,3], index=['apple','banana','cherry','pear'])
fruit2 = Series([3,2,9,5,10], index=['apple','orange','banana','cherry','mango'])

In [64]:
fruit1 + fruit2

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
pear       NaN
dtype: float64

In [65]:
fruitData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','peer'])
fruitData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango'])

In [67]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [68]:
fruit

apple     2500
banana    3800
pear      1200
cheey     6000
dtype: int64

In [71]:
fruit.sort_values() #내림차순

pear      1200
apple     2500
banana    3800
cheey     6000
dtype: int64

In [72]:
fruit.sort_values(ascending=False)

cheey     6000
banana    3800
apple     2500
pear      1200
dtype: int64

In [74]:
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [76]:
fruitFrame.sort_values(by=['fruitPrice','num']) #value가 여러개일때

        fruitPrice  num
pear          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3

In [80]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')
german.columns.values

array(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'], dtype=object)

In [81]:
german_sample =german[['Creditability','Duration of Credit (month)',
                      'Purpose','Credit Amount']]

In [82]:
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [83]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [84]:
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [85]:
german_sample.describe

<bound method NDFrame.describe of      Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]>

In [89]:
german_sample=german[['Duration of Credit (month)','Credit Amount','Age (years)']]

In [90]:
german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [92]:
german_sample = german[['Credit Amount','Type of apartment']]

In [94]:
german_grouped = german_sample['Credit Amount'].groupby(
german_sample['Type of apartment'])
german_grouped

In [95]:
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [96]:
german_sample = german[['Credit Amount','Type of apartment','Purpose']]

In [98]:
german_grouped = german_sample['Credit Amount'].groupby(
[german_sample['Purpose'],
german_sample['Type of apartment']])
german_grouped

In [99]:
german_grouped.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64